validacao/results/dvwa/dobotshield/06_wrk.log
=== wrk | dvwa/dobotshield | https://172.18.0.7:443 | 17/07/2026 23:36:42,36 ===
REPETICOES: 1
CMD: wrk -t12 -c400 -d30s --timeout 5s --latency -H "User-Agent: DoBotShield-TCC-Validation/1.0" https://172.18.0.7:443
----------------------------------------------------------------

=== EXECUCAO UNICA ===
Running 30s test @ https://172.18.0.7:443
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   235.10ms  249.62ms   1.12s    81.19%
    Req/Sec   200.40     96.94     1.31k    80.35%
  Latency Distribution
     50%   88.66ms
     75%  401.47ms
     90%  590.67ms
     99%  990.53ms
  69189 requests in 30.08s, 46.45MB read
Requests/sec:   2299.94
Transfer/sec:      1.54MB
RUN_RC=0

TOOL_RC=0