validacao/results/dvwa/dobotshield/06_wrk.log
=== wrk | dvwa/dobotshield | https://172.23.0.6:443 | 15/07/2026  8:30:12,88 ===
REPETICOES: 3
CMD: wrk -t12 -c400 -d30s --timeout 5s --latency -H "User-Agent: DoBotShield-TCC-Validation/1.0" https://172.23.0.6:443
----------------------------------------------------------------

=== REPETICAO 1/3 ===
Running 30s test @ https://172.23.0.6:443
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.96ms   12.55ms 236.88ms   88.34%
    Req/Sec     4.60k     2.63k   11.00k    59.09%
  Latency Distribution
     50%    6.25ms
     75%   13.81ms
     90%   24.32ms
     99%   58.26ms
  1633871 requests in 30.09s, 447.34MB read
  Socket errors: connect 0, read 0, write 0, timeout 2
  Non-2xx or 3xx responses: 1633551
Requests/sec:  54294.73
Transfer/sec:     14.87MB
RUN_RC_1=0

=== REPETICAO 2/3 ===
Running 30s test @ https://172.23.0.6:443
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.73ms   12.69ms 234.94ms   88.97%
    Req/Sec     4.82k     2.61k   10.74k    53.71%
  Latency Distribution
     50%    6.06ms
     75%   13.16ms
     90%   23.62ms
     99%   60.15ms
  1712923 requests in 30.09s, 468.98MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
  Non-2xx or 3xx responses: 1712603
Requests/sec:  56929.81
Transfer/sec:     15.59MB
RUN_RC_2=0

=== REPETICAO 3/3 ===
Running 30s test @ https://172.23.0.6:443
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.32ms   13.51ms 307.46ms   88.80%
    Req/Sec     4.50k     2.68k   10.92k    61.52%
  Latency Distribution
     50%    6.32ms
     75%   14.32ms
     90%   25.22ms
     99%   60.43ms
  1595932 requests in 30.07s, 436.96MB read
  Socket errors: connect 0, read 0, write 0, timeout 21
  Non-2xx or 3xx responses: 1595612
Requests/sec:  53076.31
Transfer/sec:     14.53MB
RUN_RC_3=0

TOOL_RC=0